#include "global.h"
#include "core.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/gTask_03006240.h"
#include "game/credits.h"
#include "game/save.h"
#include "game/sa1_sa2_shared/globals.h"
#include "game/stage/camera.h"
#include "game/stage/player.h"
#include "game/stage/stage.h"
#include "game/stage/ui.h"
#include "data/ui_graphics.h"

#include "constants/ui_graphics.h"
#include "constants/zones.h"

typedef struct VramPtrs {
    /* 0x00 */ void *vram0;
    /* 0x04 */ void *vram4;
} VramPtrs;

typedef struct StrcStgResults_34 {
    /* 0x00 */ GameOverB unk0;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ u16 unk1C;
    /* 0x1E */ u16 unk1E;
    /* 0x20 */ u8 unk20[0x4];
    /* 0x24 */ s32 unk24;
    /* 0x20 */ u8 filler28[0x8];
    /* 0x30 */ s32 unk30;
} StrcStgResults_34; /* 0x34 */

typedef struct StrcStgResults_38 {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 unk2;
    /* 0x04 */ u16 unk4;
    /* 0x06 */ u16 unk6;
    /* 0x08 */ u16 unk8;
    /* 0x0A */ u8 unkA;
    /* 0x0C */ struct Task *taskC; // -> StrcStgResults_34 *
    /* 0x10 */ struct Task *task10; // -> StrcStgResults_34 *
    /* 0x14 */ struct Task *task14; // -> StrcStgResults_34 *
    /* 0x18 */ struct Task *task18; // -> StrcStgResults_34 *
    /* 0x1C */ VramPtrs unk1C;
    /* 0x24 */ s16 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ u16 unk34;
    /* 0x36 */ u8 unk36;
} StrcStgResults_38; /* 0x38 */

extern void sub_8069C94(TimeRecord record);

extern ALIGNED(4) u8 gUnknown_08688404[11];
extern ALIGNED(4) u8 gUnknown_0868840F[11];
extern ALIGNED(4) u8 gUnknown_0868841C[12];

void sub_8056FE4(VramPtrs *ptrs);

void Task_8057B74(void);
void Task_8057C3C(void);
void Task_8057D30(void);
void Task_805803C(void);

// StrcStgResults_38
void Task_8057888(void);
void TaskDestructor_8058344(struct Task *t);

void sub_8056FE4(VramPtrs *arg0)
{
    Strc_80528AC sp00;
    const void *var_r0;

    sp00.uiGfxID = UIGFX_STGRESULT_HEADLINE_BACK;
    sp00.unk2B = 8;
    sp00.tiles = gUiGraphics[UIGFX_STGRESULT_HEADLINE_BACK].tiles;
    sp00.palette = gUiGraphics[UIGFX_STGRESULT_HEADLINE_BACK].palette;
    sp00.tilesSize = (8 * 2) * TILE_SIZE_4BPP;
    sp00.unk24 = 32;
    sp00.unk28 = 6;
    sp00.vramC = (void *)BG_VRAM + 0x11000; // TODO: Create VRAM_RESERVED_ #define!
    sp00.unk2A = 13;
