#include "global.h"
#include "core.h"
#include "flags.h"
#include "bg_triangles.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "data/ui_graphics.h"
#include "game/gTask_03006240.h"
#include "game/multiplayer/multipak_connection.h"
#include "game/sa1_sa2_shared/globals.h"
#include "game/save.h"
#include "game/title_screen.h"

#include "constants/animations.h"
#include "constants/songs.h"
#include "constants/text.h"
#include "constants/tilemaps.h"

#define CM_BACKGROUND_COLOR RGB16(0, 27, 30)

typedef struct ChaoMessage {
    /* 0x00 */ Background bg;
    /* 0x40 */ u8 unk40[2][4];
    /* 0x48 */ s16 unk48[4];
    /* 0x48 */ s16 unk50;
    /* 0x48 */ u16 unk52;
    /* 0x54 */ u8 unk54;
    /* 0x55 */ u8 mode;
    /* 0x56 */ u8 unk56;
} ChaoMessage; /* 0x58 */

typedef struct ChaoMsgSprite {
    /* 0x00 */ Sprite s;
    /* 0x30 */ s16 unk30;
    /* 0x32 */ s16 unk32;
    /* 0x34 */ u8 unk34;
} ChaoMsgSprite; /* 0x38 */

typedef struct ChaoMsg68 {
    GameOverB overBs[4];
    s16 unk60;
    s16 unk62;
    void *vram64;
} ChaoMsg68;

extern u8 gUnknown_03005008[MULTI_SIO_PLAYERS_MAX];

static u8 gUnknown_030058A8[6][2];
static u8 gUnknown_030058B4;
static u8 gUnknown_030058B8[4];

void sub_803AB60(ChaoMessage *message);
void Task_ChaoMessageInit(void);
void Task_803C130(void);
void Task_803B7AC(void);
void sub_803B944(void);
void sub_803BAD4(void);
void sub_803BC64(void);
void sub_803BE0C(void);
void sub_803BEB8(void);
void sub_803BFE8(void);
void TaskDestructor_803C184(struct Task *t);
void TaskDestructor_803C198(struct Task *t);

extern void sub_8018538(void);
extern void CreateMultiplayerContinueScreen(void);

void CreateMultiplayerResultsScreen(u8 mode)
{
    s32 sp4;
    Background *bg;
    ChaoMessage *message;
    u8 *temp_r0;
    u8 temp_r0_2;
    u8 temp_r0_3;
    u8 var_r2;

    gUnknown_030058B8[0] = 0;
    gUnknown_030058B8[1] = 0;
