#include "global.h"
#include "core.h"
#include "flags.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/entity.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/multiplayer/mp_player.h"
#include "game/stage/player.h"
#include "game/stage/player_controls.h"
#include "game/stage/terrain_collision.h"

#include "constants/animations.h"
#include "constants/char_states.h"
#include "constants/interactables.h"
#include "constants/songs.h"
#include "constants/vram_hardcoded.h"
#include "constants/zones.h"

typedef struct {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ u16 unk3C;
    /* 0x40 */ s32 unk40; // Q
    /* 0x44 */ s32 unk44; // Q
    /* 0x48 */ s16 unk48;
    /* 0x4A */ s16 unk4A;
    /* 0x4C */ s16 unk4C;
    /* 0x4E */ u8 unk4E;
} BumperA;

typedef struct {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ u16 unk3C;
    /* 0x40 */ s32 unk40; // Q
    /* 0x44 */ s32 unk44; // Q
    /* 0x48 */ s16 unk48;
    /* 0x4A */ s16 unk4A;
    /* 0x4C */ u16 unk4C;
    /* 0x4E */ u8 unk4E;
    /* 0x4F */ u8 unk4F;
    /* 0x50 */ u8 unk50;
    /* 0x51 */ u8 unk51;
} BumperB;

// Triangular Bumpers
// TODO: Might be equivalent to BumperA?
typedef struct {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ u16 unk3C;
    /* 0x40 */ s32 unk40; // Q
    /* 0x44 */ s32 unk44; // Q
    /* 0x48 */ s16 unk48;
    /* 0x4A */ s16 unk4A;
    /* 0x4C */ u8 unk4C;
    /* 0x4D */ u8 unk4D;
    /* 0x4E */ u8 unk4E;
} BumperC;

void Task_BumperHexagon(void);
void Task_BumperHexagon2(void);
void TaskDestructor_BumperHexagon(struct Task *t);
void Task_BumperRound_LinearMov2(void);
void Task_BumperRound_LinearMov(void);
void Task_BumperRound_CircularMov(void);
void Task_BumperRound_CircularMov2(void);
void Task_BumperTriHorizontal(void);
void Task_BumperTriHorizontal2(void);
void Task_BumperTriVertical(void);
void Task_BumperTriVertical2(void);
void Task_BumperTriBig(void);
void Task_BumperTriBig2(void);

bool32 BumperCheckCollAndPosA1(BumperA *bumper, Sprite *s, s32 worldX, s32 worldY);
bool32 BumperCheckCollAndPosA2(BumperA *bumper, Sprite *s, s32 worldX, s32 worldY);
bool32 BumperCheckCollAndPosB(BumperB *bumper, Sprite *s, s32 worldX, s32 worldY);
bool32 BumperCheckCollAndPosC1(BumperC *bumper, Sprite *s, s32 worldX, s32 worldY);
bool32 BumperCheckCollAndPosC2(BumperC *bumper, Sprite *s, s32 worldX, s32 worldY);
