#include "global.h"
#include "core.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/entity.h"
#include "game/save.h"
#include "game/enemies/bosses_shared.h" // CreatePreBossCameraPan
#include "game/nuts_and_bolts_task.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/stage/screen_shake.h"
#include "game/stage/terrain_collision.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/songs.h"

/* X-Zone Final Boss */

typedef struct EggX_64 {
    Sprite s;
    u8 filler30[0x4A];
    u8 unk7A;
    u8 unk7B;
} EggX_64;

typedef struct EggX_7C {
    u8 filler0[0x78];
    u8 unk78;
    u8 unk79;
    u8 unk7A;
    u8 unk7B;
} EggX_7C;

typedef struct EggX {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ Hitbox reserved;
    /* 0x44 */ Sprite s2;
    /* 0x80 */ s32 qUnk74;
    /* 0x80 */ s32 qUnk78;
    /* 0x80 */ s32 qUnk7C;
    /* 0x80 */ s32 qUnk80;
    /* 0x84 */ s32 unk84;
    /* 0x88 */ s16 unk88;
    /* 0x8A */ s16 unk8A;
    /* 0x8C */ s16 unk8C;
    /* 0x8E */ s16 unk8E;
    /* 0x90 */ u16 unk90;
    /* 0x92 */ u16 unk92;
    /* 0x94 */ s8 unk94;
    /* 0x95 */ s8 unk95;
    /* 0x96 */ u16 unk96;
    /* 0x98 */ u8 unk98;
    /* 0x99 */ u8 unk99;
    /* 0x9A */ u8 unk9A;
    /* 0x9C */ struct Task *task9C; // -> EggX_7C
} EggX; /* 0xA0 */

void Task_EggXMain(void);
void sub_80370B4(void);
void Task_803753C(void);
void Task_803775C(void);
void sub_8038F04(void);
void TaskDestructor_EggX(struct Task *t);

void sub_8036E20(CamCoord worldX, CamCoord worldY);
void sub_803803C(void);
void sub_803967C(void);
void sub_8039940(void);
u8 sub_803711C(s16 arg0);

extern const s16 gUnknown_084ACF1C[4];
extern const s16 gUnknown_084ACF24[];
extern const s16 gUnknown_084ACF2C[];
extern const s16 gUnknown_084ACF34[];

static inline void CopySpritePos__inline()
{
    EggX *boss = TASK_DATA(gCurTask);
    Sprite *s = &boss->s;
    Sprite *s2 = &boss->s2;

    s2->x = s->x;
    s2->y = s->y;
}

static inline void SetSpritePos__inline(CamCoord worldX, CamCoord worldY)
{
    EggX *boss = TASK_DATA(gCurTask);
    Sprite *s = &boss->s;
    s->x = worldX - gCamera.x;
    s->y = worldY - gCamera.y;
}

static inline void ChangeVariant__inline()
{
