#include "global.h"
#include "core.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/entity.h"
#include "game/enemies/bosses_shared.h" // sub_80174DC
#include "game/sa1_sa2_shared/collision.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/songs.h"

/* Sonic 1's Green Hill Zone Boss */

typedef struct {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ Sprite s2;
    /* 0x6C */ s32 unk6C;
    /* 0x70 */ s32 unk70;
    /* 0x74 */ s32 unk74;
    /* 0x78 */ s32 unk78;
    /* 0x7C */ CamCoord worldX;
    /* 0x7E */ CamCoord worldY;
    /* 0x80 */ CamCoord unk80;
    /* 0x82 */ CamCoord unk82;
    /* 0x84 */ u16 unk84;
    /* 0x86 */ s8 unk86;
    /* 0x87 */ s8 unk87;
    /* 0x88 */ s16 unk88;
    /* 0x8A */ s16 unk8A;
    /* 0x8C */ s8 unk8C;
    /* 0x8D */ u8 unk8D;
    /* 0x8D */ u8 unk8E;
} EggWrecker; /* 0x90 */

void Task_EggWreckerInit(void);
void Task_8034718(void);
void Task_803491C(void);
void sub_80343E0(void);
void sub_8035010(void);
void TaskDestructor_EggWrecker(struct Task *t);

// TODO: This function does not have an implementation at the end of the file...
//       maybe originally EggWrecker and EggDrillster were in the same file?
static inline void setPlayerPos_inline(CamCoord worldX, CamCoord worldY)
{
    EggWrecker *boss = TASK_DATA(gCurTask);
    Sprite *s = &boss->s;
    s->x = worldX - gCamera.x;
    s->y = worldY - gCamera.y;
}
static inline void sub_8035904_inline()
{
    EggWrecker *boss = TASK_DATA(gCurTask);
    Sprite *s = &boss->s;
    Sprite *s2 = &boss->s2;

    s2->x = s->x;
    s2->y = s->y;

    if (s2->graphics.anim == SA1_ANIM_EGGMAN) {
        s2->y -= 3;
    }
}

void sub_80342A0(s16 worldX, s16 worldY)
{
    s16 temp_r6;
    s16 temp_r7;
    s32 temp_r0;
    s32 temp_r1;
    s32 temp_r2;
    u16 temp_r3;
