#include "global.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/sa1_sa2_shared/player.h"
#include "game/entity.h"
#include "game/enemies/bosses_shared.h"
#include "game/nuts_and_bolts_task.h"
#include "game/save.h"
#include "game/stage/dust_effect_braking.h"
#include "game/stage/player_controls.h"
#include "game/stage/rings_scatter.h"
#include "game/stage/screen_shake.h"
#include "game/stage/terrain_collision.h"
#include "game/water_effects.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/char_states.h"
#include "constants/songs.h"
#include "game/stage/underwater_effects.h"

// TODO: Automate inserting 'MECHA_KNUX_PARTS_VARIANTS' from animation itself!
#define MECHA_KNUX_PARTS_VARIANTS 6

typedef struct MechaKnuckles {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ Hitbox reserved;
    /* 0x44 */ Sprite s2;
    /* 0x74 */ s32 qUnk74;
    /* 0x78 */ s32 qUnk78;
    /* 0x7C */ s16 unk7C;
    /* 0x7E */ s16 unk7E;
    /* 0x80 */ s16 unk80;
    /* 0x82 */ s16 unk82;
    /* 0x84 */ u16 unk84;
    /* 0x88 */ u32 flags88;
    /* 0x8C */ s32 unk8C;
    /* 0x90 */ s32 unk90;
    /* 0x94 */ s8 unk94;
    /* 0x95 */ s8 unk95;
    /* 0x96 */ s8 unk96;
    /* 0x97 */ s8 unk97;
    /* 0x98 */ s8 unk98;
    /* 0x99 */ s8 unk99;
    /* 0x9A */ s8 unk9A;
    /* 0x9B */ u8 unk9B;
} MechaKnuckles; /* 0x9C */

typedef struct MechaKnucklesRocket {
    /* 0x00 */ s32 unk0;
    /* 0x00 */ s32 unk4;
    /* 0x00 */ s16 unk8;
    /* 0x00 */ s16 unkA;
    /* 0x00 */ s16 unkC;
    /* 0x00 */ s16 unkE;
    /* 0x00 */ s16 unk10;
    /* 0x00 */ s16 unk12;
    /* 0x14 */ Sprite s;
    /* 0x44 */ SpriteTransform transform;
} MechaKnucklesRocket; /* 0x50 */

typedef struct MechaKnucklesParts {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s16 unk8;
    /* 0x0A */ s16 unkA;
    /* 0x0C */ s16 unkC;
    /* 0x0E */ s16 unkE;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ s16 unk12;
    /* 0x14 */ s16 unk14;
    /* 0x18 */ Sprite s;
    /* 0x48 */ SpriteTransform transform;
} MechaKnucklesParts; /* 0x54 */

typedef bool32 (*MechaKnuxPlayerFn)(MechaKnuckles *boss, Player *p);
typedef void (*MechaKnuxFn)(MechaKnuckles *boss, Player *p);

typedef struct Unk {
    s16 anim;
    u8 variant;
    u8 unk3;
} Unk;

void Task_MechaKnucklesInit(void);
void TaskDestructor_MechaKnuckles(struct Task *t);
void sub_804E8D4(MechaKnuckles *boss, s32 param1);
void sub_804EC60(MechaKnuckles *boss, MapEntity *me);

void CreateMechaKnucklesRocket(MechaKnuckles *boss);
void Task_MechaKnucklesRocketInit(void);
void TaskDestructor_MechaKnuckles_Rocket(struct Task *t);

struct Task *CreateMechaKnucklesParts(MechaKnuckles *boss, s32 variant);
void Task_MechaKnucklesPartsInit(void);
void TaskDestructor_MechaKnuckles_Parts(struct Task *t);

void sub_804EB04(MechaKnuckles *boss);
void sub_804EB90(MechaKnuckles *boss);
bool32 sub_804EE20(MechaKnuckles *boss);
void sub_804FDD4(MechaKnuckles *boss);

