#include "global.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/sa1_sa2_shared/player.h"
#include "game/entity.h"
#include "game/enemies/bosses_shared.h"
#include "game/nuts_and_bolts_task.h"
#include "game/save.h"
#include "game/stage/player_controls.h"
#include "game/stage/screen_shake.h"
#include "game/stage/terrain_collision.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/songs.h"

typedef struct EHTArm {
    /* 0x00 */ Sprite s;
    /* 0x30 */ SpriteTransform transform;
    /* 0x3C */ s16 unk3C;
    /* 0x3E */ s16 unk3E;
    /* 0x40 */ u16 unk40;
    /* 0x44 */ s32 qUnk44;
    /* 0x48 */ s32 qUnk48;
    /* 0x4C */ s16 qUnk4C;
    /* 0x4E */ s16 qUnk4E;
    /* 0x50 */ u8 unk50;
} EHTArm; /* 0x54 */

typedef struct EHTHammer {
    /* 0x00 */ Sprite s;
    /* 0x30 */ SpriteTransform transform;
    /* 0x3C */ s16 unk3C;
    /* 0x3E */ s16 unk3E;
    /* 0x40 */ s16 unk40;
    /* 0x40 */ s16 unk42;
    /* 0x44 */ s32 qUnk44;
    /* 0x48 */ s32 qUnk48;
    /* 0x4C */ s16 qUnk4C;
    /* 0x4E */ s16 qUnk4E;
    /* 0x50 */ u8 unk50;
} EHTHammer; /* 0x54 */

typedef struct EggHammerTank {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ Hitbox reserved;
    /* 0x44 */ Sprite s2;
    /* 0x74 */ struct Task *taskHammer;
    /* 0x78 */ struct Task *tasksArm[5];
    /* 0x8C */ s32 qUnk8C;
    /* 0x90 */ s32 qUnk90;
    /* 0x94 */ s16 unk94;
    /* 0x96 */ s16 unk96;
    /* 0x98 */ u16 unk98;
    /* 0x9A */ s8 unk9A;
    /* 0x9B */ s8 unk9B;
    /* 0x9C */ u8 unk9C;
    /* 0x9C */ u8 unk9D;
    /* 0x9C */ s16 qUnk9E;
} EggHammerTank; /* 0xA0 */

void Task_EHTArm(void);
void Task_80272D0(void);
void TaskDestructor_EHTArm(struct Task *t);

struct Task *CreatePreBossCameraPan(s16, s16);
struct Task *sub_8017540(s32, s32);
void Task_802611C();
void Task_EHTArm();
void Task_EHTHammer();
void Task_EggHammerTankMain();
void Task_EggHammerTank_Intro();
void TaskDestructor_EggHammerTank(struct Task *);
void TaskDestructor_EHTHammer(struct Task *);
void Task_8025CC4();
void Task_8025D80();
void Task_8025E6C();
void Task_80264C8();
void Task_8026C44();
void Task_8026ED0(void);
void Task_80271E4();
void Task_8027600();
void Task_8027714();

void CreateEntity_EggHammerTank_Intro(MapEntity *me, u16 regionX, u16 regionY, u8 id)
{
    struct Task *t;
    EggHammerTank *tank;
    Sprite *s;
    Sprite *s2;
    s16 tempY;
    SpriteBase *base;

    if (IS_MULTI_PLAYER) {
        SET_MAP_ENTITY_INITIALIZED(me);
        return;
    }

