#include "global.h"
#include "core.h"
#include "flags.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/entity.h"
#include "game/save.h"
#include "game/enemies/bosses_shared.h" // CreatePreBossCameraPan
#include "game/nuts_and_bolts_task.h"
#include "game/sa1_sa2_shared/collision.h"
#include "game/stage/player.h"
#include "game/stage/results.h"
#include "game/stage/rings_scatter.h"
#include "game/stage/screen_shake.h"
#include "game/stage/stage.h"
#include "game/stage/terrain_collision.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/char_states.h"
#include "constants/songs.h"
#include "constants/zones.h" // for ALL_ZONE_CHAOS_EMERALDS

/* X-Zone Final Boss */

typedef struct EggX_10 {
    u16 unk0;
    u16 unk2;
    u16 unk4;
    u16 unk6;
    u8 unk8;
    u8 unk9;
    s16 unkA;
    s16 qUnkC;
    u16 unkE;
} EggX_10;

typedef struct EggX_48 {
    Sprite s;
    u16 unk30;
    u8 filler32[0x2];
    s32 qUnk34;
    s32 qUnk38;
    s16 qUnk3C;
    s16 qUnk3E;
    u16 unk40;
    u16 unk42;
    u16 unk44;
    u8 filler46[0x2];
} EggX_48;

typedef struct EggX_Sparkle {
    /* 0x00 */ Sprite s;
    /* 0x30 */ SpriteTransform transform;
    /* 0x3C */ u16 unk3C;
    /* 0x3E */ u8 filler3E[0x2];
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s16 unk48;
    /* 0x4A */ s16 unk4A;
    /* 0x4C */ s16 unk4C;
    /* 0x4E */ s16 unk4E;
    /* 0x50 */ s16 unk50;
    /* 0x52 */ s16 unk52;
    /* 0x52 */ s32 unk54;
    /* 0x52 */ s32 unk58;
    /* 0x5C */ s16 unk5C;
    /* 0x5E */ s16 unk5E;
    /* 0x60 */ u8 unk60;
    /* 0x61 */ u8 unk61;
    /* 0x62 */ u8 unk62;
} EggX_Sparkle;

typedef struct EggX_7C {
    Sprite s;
    Sprite s2;
    s16 unk60;
    u8 filler62[0x2];
    s32 unk64;
    s32 unk68;
    s32 unk6C;
    s32 unk70;
    u16 unk74;
    u16 unk76;
    u8 unk78;
    u8 unk79;
    u8 unk7A;
    u8 unk7B;
} EggX_7C;

typedef struct EggX {
    /* 0x00 */ SpriteBase base;
    /* 0x0C */ Sprite s;
    /* 0x3C */ Hitbox reserved;
    /* 0x44 */ Sprite s2;
    /* 0x80 */ s32 qUnk74;
    /* 0x80 */ s32 qUnk78;
    /* 0x80 */ s32 qUnk7C;
    /* 0x80 */ s32 qUnk80;
    /* 0x84 */ s32 unk84;
    /* 0x88 */ s16 unk88;
    /* 0x8A */ s16 unk8A;
    /* 0x8C */ s16 unk8C;
    /* 0x8E */ s16 unk8E;
    /* 0x90 */ u16 unk90;
    /* 0x92 */ u16 unk92;
    /* 0x94 */ s8 unk94;
    /* 0x95 */ s8 unk95;
    /* 0x96 */ u16 unk96;
    /* 0x98 */ u8 unk98;
    /* 0x99 */ u8 unk99;
    /* 0x9A */ u8 unk9A;
    /* 0x9C */ struct Task *task9C; // -> EggX_7C
} EggX; /* 0xA0 */

void Task_EggXMain(void);
void sub_8036E20(CamCoord worldX, CamCoord worldY);
enum EHit sub_8036F9C(CamCoord worldX, CamCoord worldY, u8 arg2);
void sub_80370B4(void);
u8 sub_803711C(s16 arg0);
void Task_803753C(void);
void Task_803775C(void);
void sub_803803C(void);
void Task_8038154(void);
void sub_8038E34(void);
void sub_8038B38(void);
void sub_8038BC8(void);
void sub_8038C20(void);
void sub_8038D2C(void);
void sub_8038420(CamCoord worldX, CamCoord worldY);
void sub_8038F04(void);
void sub_8039074(u8 param0);
void sub_8039108(void);
void sub_803918C(u8 param0);
void Task_8039264(void);
void Task_803A2F8(void);
void sub_803967C(void);
void Task_80397A8(void);
void sub_8039940(void);
void Task_8039A64(void);
void sub_803A1D8(void);
void Task_803A46C(void);
void sub_803A54C(void);
void sub_803A594(void);
void sub_803A170(u32 param0);

void TaskDestructor_EggX7C(struct Task *t);
